<p> Wenn du Probleme bei der Nutzung der Seite hast, sag uns einfach Bescheid. Wir werden versuchen, dir schnellstm&ouml;glich
    zu helfen. Du erreichst uns &uuml;ber folgende E-Mail Adresse:
    <a href="mailto:adventskalender@ieee.uni-passau.de">adventskalender@ieee.uni-passau.de</a>
</p>
<h3 id="imprint">Impressum</h3>
<p>IEEE Student Branch Passau
    <br>Universit&auml;t Passau
    <br>Innstra&szlig;e 33
    <br>94032 Passau
    <br>Deutschland
    <br>E-Mail: <a href="mailto:ieeesb@fim.uni-passau.de">ieeesb@fim.uni-passau.de</a>
    <br>Website: <a href="https://ieee.uni-passau.de">https://ieee.uni-passau.de</a>
</p>
<h4>Angaben gem&auml;&szlig; §5 TMG</h4>
<p>IEEE Student Branch Passau
    <br>Simon Labrenz, Chairman
    <br>Universit&auml;t Passau
    <br>Innstra&szlig;e 33
    <br>94032 Passau
    <br>Deutschland
</p>
<p>Gem&auml;&szlig; den IEEE Bylaws ist die Student Branch eine Organisationseinheit innerhalb von IEEE Inc.</p>
<p>Headquarter:</p>
<p>Institute of Electrical and Electronics Engineers, Inc.
    <br>IEEE Corporate Office
    <br>3 Park Avenue, 17th Floor
    <br>New York, NY 10016-5997
    <br>USA
</p>
<h3 id="privacy">Datenschutzerkl&auml;rung</h3>
<p>Wir freuen uns sehr &uuml;ber Ihr Interesse an unserer Hochschulgruppe. Datenschutz hat einen besonders hohen Stellenwert
    f&uuml;r den Vorstand der IEEE Student Branch Passau. Eine Nutzung der Internetseiten der IEEE Student Branch Passau ist
    grunds&auml;tzlich ohne jede Angabe personenbezogener Daten m&ouml;glich. Sofern eine betroffene Person besondere Services
    unseres Unternehmens &uuml;ber unsere Internetseite in Anspruch nehmen m&ouml;chte, k&ouml;nnte jedoch eine Verarbeitung
    personenbezogener Daten erforderlich werden. Ist die Verarbeitung personenbezogener Daten erforderlich und besteht
    f&uuml;r eine solche Verarbeitung keine gesetzliche Grundlage, holen wir generell eine Einwilligung der betroffenen
    Person ein.
    <br>Die Verarbeitung personenbezogener Daten, beispielsweise des Namens, der Anschrift, E-Mail-Adresse oder
    Telefonnummer einer betroffenen Person, erfolgt stets im Einklang mit der Datenschutz-Grundverordnung und in
    &Uuml;bereinstimmung mit den f&uuml;r die IEEE Student Branch Passau geltenden landesspezifischen Datenschutzbestimmungen.
    Mittels dieser Datenschutzerkl&auml;rung m&ouml;chte unser Unternehmen die &Ouml;ffentlichkeit &uuml;ber Art, Umfang und Zweck der von
    uns erhobenen, genutzten und verarbeiteten personenbezogenen Daten informieren. Ferner werden betroffene Personen
    mittels dieser Datenschutzerkl&auml;rung &uuml;ber die ihnen zustehenden Rechte aufgekl&auml;rt.
    <br>Die IEEE Student Branch Passau hat als f&uuml;r die Verarbeitung Verantwortlicher zahlreiche technische und
    organisatorische Ma&szlig;nahmen umgesetzt, um einen m&ouml;glichst l&uuml;ckenlosen Schutz der &uuml;ber diese Internetseite
    verarbeiteten personenbezogenen Daten sicherzustellen. Dennoch k&ouml;nnen Internet-basierte Daten&uuml;bertragungen
    grunds&auml;tzlich Sicherheitsl&uuml;cken aufweisen, sodass ein absoluter Schutz nicht gew&auml;hrleistet werden kann. Aus diesem
    Grund steht es jeder betroffenen Person frei, personenbezogene Daten auch auf alternativen Wegen, beispielsweise
    pers&ouml;nlich oder per Mail, an uns zu &uuml;bermitteln.
</p>
<h4>Begriffsbestimmungen</h4>
<p>Datenschutzerkl&auml;rung der IEEE Student Branch Passau beruht auf den Begrifflichkeiten, die durch den Europ&auml;ischen
    Richtlinien- und Verordnungsgeber beim Erlass der Datenschutz-Grundverordnung (DSGVO) verwendet wurden. Unsere
    Datenschutzerkl&auml;rung soll sowohl f&uuml;r die &Ouml;ffentlichkeit als auch f&uuml;r unsere Kunden und Gesch&auml;ftspartner einfach
    lesbar und verst&auml;ndlich sein. Um dies zu gew&auml;hrleisten, m&ouml;chten wir vorab die verwendeten Begrifflichkeiten
    erl&auml;utern.
</p>
<p>Wir verwenden in dieser Datenschutzerkl&auml;rung unter anderem die folgenden Begriffe:</p>
<ul>
    <li><strong>Personenbezogene Daten:</strong>
        Personenbezogene Daten sind alle Informationen, die sich auf eine
        identifizierte oder identifizierbare nat&uuml;rliche Person (im Folgenden „betroffene Person“) beziehen. Als
        identifizierbar wird eine nat&uuml;rliche Person angesehen, die direkt oder indirekt, insbesondere mittels Zuordnung
        zu einer Kennung wie einem Namen, zu einer Kennnummer, zu Standortdaten, zu einer Online-Kennung oder zu einem
        oder mehreren besonderen Merkmalen, die Ausdruck der physischen, physiologischen, genetischen, psychischen,
        wirtschaftlichen, kulturellen oder sozialen Identit&auml;t dieser nat&uuml;rlichen Person sind, identifiziert werden kann.
    </li>
    <li><strong>Betroffene Person:</strong>
        Betroffene Person ist jede identifizierte oder identifizierbare nat&uuml;rliche Person, deren personenbezogene Daten
        von dem f&uuml;r die Verarbeitung Verantwortlichen verarbeitet werden.
    </li>
    <li><strong>Verarbeitung:</strong>
        Verarbeitung ist jeder mit oder ohne Hilfe automatisierter Verfahren ausgef&uuml;hrte Vorgang oder jede solche
        Vorgangsreihe im Zusammenhang mit personenbezogenen Daten wie das Erheben, das Erfassen, die Organisation,
        das Ordnen, die Speicherung, die Anpassung oder Ver&auml;nderung, das Auslesen, das Abfragen, die Verwendung, die
        Offenlegung durch &Uuml;bermittlung, Verbreitung oder eine andere Form der Bereitstellung, den Abgleich oder die
        Verkn&uuml;pfung, die Einschr&auml;nkung, das L&ouml;schen oder die Vernichtung.
    </li>
    <li><strong>Einschr&auml;nkung der Verarbeitung:</strong>
        Einschr&auml;nkung der Verarbeitung ist die Markierung gespeicherter personenbezogener Daten mit dem Ziel, ihre
        k&uuml;nftige Verarbeitung einzuschr&auml;nken.
    </li>
    <li><strong>Profiling:</strong>
        Profiling ist jede Art der automatisierten Verarbeitung personenbezogener Daten, die darin besteht, dass diese
        personenbezogenen Daten verwendet werden, um bestimmte pers&ouml;nliche Aspekte, die sich auf eine nat&uuml;rliche Person
        beziehen, zu bewerten, insbesondere, um Aspekte bez&uuml;glich Arbeitsleistung, wirtschaftlicher Lage, Gesundheit,
        pers&ouml;nlicher Vorlieben, Interessen, Zuverl&auml;ssigkeit, Verhalten, Aufenthaltsort oder Ortswechsel dieser
        nat&uuml;rlichen Person zu analysieren oder vorherzusagen.
    </li>
    <li><strong>Pseudonymisierung:</strong>
        Pseudonymisierung ist die Verarbeitung personenbezogener Daten in einer Weise, auf welche die personenbezogenen
        Daten ohne Hinzuziehung zus&auml;tzlicher Informationen nicht mehr einer spezifischen betroffenen Person zugeordnet
        werden k&ouml;nnen, sofern diese zus&auml;tzlichen Informationen gesondert aufbewahrt werden und technischen und
        organisatorischen Ma&szlig;nahmen unterliegen, die gew&auml;hrleisten, dass die personenbezogenen Daten nicht einer
        identifizierten oder identifizierbaren nat&uuml;rlichen Person zugewiesen werden.
    </li>
    <li><strong>Verantwortlicher oder f&uuml;r die Verarbeitung Verantwortlicher:</strong>
        Verantwortlicher oder f&uuml;r die Verarbeitung Verantwortlicher ist die nat&uuml;rliche oder juristische Person, Beh&ouml;rde,
        Einrichtung oder andere Stelle, die allein oder gemeinsam mit anderen &uuml;ber die Zwecke und Mittel der
        Verarbeitung von personenbezogenen Daten entscheidet. Sind die Zwecke und Mittel dieser Verarbeitung durch das
        Unionsrecht oder das Recht der Mitgliedstaaten vorgegeben, so kann der Verantwortliche beziehungsweise k&ouml;nnen
        die bestimmten Kriterien seiner Benennung nach dem Unionsrecht oder dem Recht der Mitgliedstaaten vorgesehen
        werden.
    </li>
    <li><strong>Auftragsverarbeiter:</strong>
        Auftragsverarbeiter ist eine nat&uuml;rliche oder juristische Person, Beh&ouml;rde, Einrichtung oder andere Stelle, die
        personenbezogene Daten im Auftrag des Verantwortlichen verarbeitet.
    </li>
    <li><strong>Empf&auml;nger:</strong>
        Empf&auml;nger ist eine nat&uuml;rliche oder juristische Person, Beh&ouml;rde, Einrichtung oder andere Stelle, der
        personenbezogene Daten offengelegt werden, unabh&auml;ngig davon, ob es sich bei ihr um einen Dritten handelt oder
        nicht. Beh&ouml;rden, die im Rahmen eines bestimmten Untersuchungsauftrags nach dem Unionsrecht oder dem Recht der
        Mitgliedstaaten m&ouml;glicherweise personenbezogene Daten erhalten, gelten jedoch nicht als Empf&auml;nger.
    </li>
    <li><strong>Dritter:</strong>
        Dritter ist eine nat&uuml;rliche oder juristische Person, Beh&ouml;rde, Einrichtung oder andere Stelle au&szlig;er der
        betroffenen Person, dem Verantwortlichen, dem Auftragsverarbeiter und den Personen, die unter der unmittelbaren
        Verantwortung des Verantwortlichen oder des Auftragsverarbeiters befugt sind, die personenbezogenen Daten zu
        verarbeiten.
    </li>
    <li><strong>Einwilligung:</strong>
        Einwilligung ist jede von der betroffenen Person freiwillig f&uuml;r den bestimmten Fall in informierter Weise und
        unmissverst&auml;ndlich abgegebene Willensbekundung in Form einer Erkl&auml;rung oder einer sonstigen eindeutigen
        best&auml;tigenden Handlung, mit der die betroffene Person zu verstehen gibt, dass sie mit der Verarbeitung der sie
        betreffenden personenbezogenen Daten einverstanden ist.
    </li>
</ul>
<h4>Name und Anschrift des f&uuml;r die Verarbeitung Verantwortlichen</h4>
<p>Verantwortlicher im Sinne der Datenschutz-Grundverordnung, sonstiger in den Mitgliedstaaten der Europ&auml;ischen Union
    geltenden Datenschutzgesetze und anderer Bestimmungen mit datenschutzrechtlichem Charakter ist die:
    <br>IEEE Student Branch Passau
    <br>Innstra&szlig;e 33
    <br>94032 Passau
    <br>Deutschland
    <br>E-Mail: <a href="mailto:ieeesb@fim.uni-passau.de">ieeesb@fim.uni-passau.de</a>
    <br>Website: <a href="https://ieee.uni-passau.de">https://ieee.uni-passau.de</a>
</p>
<h4>Cookies</h4>
<p>Die Internetseiten der IEEE Student Branch Passau verwenden Cookies. Cookies sind Textdateien, welche &uuml;ber einen
    Internetbrowser auf einem Computersystem abgelegt und gespeichert werden.
    <br>Zahlreiche Internetseiten und Server
    verwenden Cookies. Viele Cookies enthalten eine sogenannte Cookie-ID. Eine Cookie-ID ist eine eindeutige Kennung des
    Cookies. Sie besteht aus einer Zeichenfolge, durch welche Internetseiten und Server dem konkreten Internetbrowser
    zugeordnet werden k&ouml;nnen, in dem das Cookie gespeichert wurde. Dies erm&ouml;glicht es den besuchten Internetseiten und
    Servern, den individuellen Browser der betroffenen Person von anderen Internetbrowsern, die andere Cookies
    enthalten, zu unterscheiden. Ein bestimmter Internetbrowser kann &uuml;ber die eindeutige Cookie-ID wiedererkannt und
    identifiziert werden.
    <br>Durch den Einsatz von Cookies kann die IEEE Student Branch Passau den Nutzern dieser Internetseite
    nutzerfreundlichere Services bereitstellen, die ohne die Cookie-Setzung nicht m&ouml;glich w&auml;ren.
    <br>Mittels eines Cookies k&ouml;nnen die Informationen und Angebote auf unserer Internetseite im Sinne des Benutzers
    optimiert werden. Cookies erm&ouml;glichen uns, wie bereits erw&auml;hnt, die Benutzer unserer Internetseite wiederzuerkennen.
    Zweck dieser Wiedererkennung ist es, den Nutzern die Verwendung unserer Internetseite zu erleichtern. Der Benutzer
    einer Internetseite, die Cookies verwendet, muss beispielsweise nicht bei jedem Besuch der Internetseite erneut
    seine Zugangsdaten eingeben, weil dies von der Internetseite und dem auf dem Computersystem des Benutzers abgelegten
    Cookie &uuml;bernommen wird. Ein weiteres Beispiel ist das Cookie eines Warenkorbes im Online-Shop. Der Online-Shop merkt
    sich die Artikel, die ein Kunde in den virtuellen Warenkorb gelegt hat, &uuml;ber ein Cookie.
    <br>Die betroffene Person kann die Setzung von Cookies durch unsere Internetseite jederzeit mittels einer
    entsprechenden Einstellung des genutzten Internetbrowsers verhindern und damit der Setzung von Cookies dauerhaft
    widersprechen. Ferner k&ouml;nnen bereits gesetzte Cookies jederzeit &uuml;ber einen Internetbrowser oder andere
    Softwareprogramme gel&ouml;scht werden. Dies ist in allen g&auml;ngigen Internetbrowsern m&ouml;glich. Deaktiviert die betroffene
    Person die Setzung von Cookies in dem genutzten Internetbrowser, sind unter Umst&auml;nden nicht alle Funktionen unserer
    Internetseite vollumf&auml;nglich nutzbar.
</p>
<p>Der Adventskalender verwendet diese Cookies:</p>
<ul>
    <li><code>cookieconsent_status</code>: speichert, ob der Nutzer das Cookie-Banner gelesen hat. Es speichert keine personenbezogenen Daten und ist persistent.</li>
    <li><code>csrfToken</code>: wird ben&ouml;tigt, um CSRF-Attacken zu verhindern. Es ist nicht persistent.</li>
    <li><code>PLAY_SESSION</code>: enth&auml;lt Informationen &uuml;ber die Session, die zur Identifizierung des Nutzers verwendet werden. Es ist technisch notw&auml;ndig. Standardm&auml;&szlig;ig ist es nicht persistent, der Nutzer kann jedoch beim Login ausw&auml;hlen, dass es persistiert werden soll.</li>
    <li><code>PLAY_LANG</code>: speichert die ausgew&auml;hlte Sprache. Es enth&auml;lt keine personenbezogenen Daten und ist nur persistent, wenn <code>PLAY_SESSION</code> auch persistent ist.</li>
</ul>
<h4>Erfassung von allgemeinen Daten und Informationen</h4>
<p>Die Internetseite der IEEE Student Branch Passau erfasst mit jedem Aufruf der Internetseite durch eine betroffene
    Person oder ein automatisiertes System eine Reihe von allgemeinen Daten und Informationen. Diese allgemeinen Daten
    und Informationen werden in den Logfiles des Servers gespeichert. Erfasst werden k&ouml;nnen die (1) verwendeten
    Browsertypen und Versionen, (2) das vom zugreifenden System verwendete Betriebssystem, (3) die Internetseite, von
    welcher ein zugreifendes System auf unsere Internetseite gelangt (sogenannte Referrer), (4) die Unterwebseiten,
    welche &uuml;ber ein zugreifendes System auf unserer Internetseite angesteuert werden, (5) das Datum und die Uhrzeit
    eines Zugriffs auf die Internetseite, (6) eine Internet-Protokoll-Adresse (IP-Adresse), (7) der
    Internet-Service-Provider des zugreifenden Systems und (8) sonstige &auml;hnliche Daten und Informationen, die der
    Gefahrenabwehr im Falle von Angriffen auf unsere informationstechnologischen Systeme dienen.
    <br>Bei der Nutzung dieser allgemeinen Daten und Informationen zieht die IEEE Student Branch Passau keine
    R&uuml;ckschl&uuml;sse auf die betroffene Person. Diese Informationen werden vielmehr ben&ouml;tigt, um (1) die Inhalte unserer
    Internetseite korrekt auszuliefern, (2) die Inhalte unserer Internetseite sowie die Werbung f&uuml;r diese zu optimieren,
    (3) die dauerhafte Funktionsf&auml;higkeit unserer informationstechnologischen Systeme und der Technik unserer
    Internetseite zu gew&auml;hrleisten sowie (4) um Strafverfolgungsbeh&ouml;rden im Falle eines Cyberangriffes die zur
    Strafverfolgung notwendigen Informationen bereitzustellen. Diese anonym erhobenen Daten und Informationen werden
    durch die IEEE Student Branch Passau daher einerseits statistisch und ferner mit dem Ziel ausgewertet, den
    Datenschutz und die Datensicherheit in unserer Hochschulgruppe zu erh&ouml;hen, um letztlich ein optimales Schutzniveau
    f&uuml;r die von uns verarbeiteten personenbezogenen Daten sicherzustellen. Die anonymen Daten der
    Server-Protokolldateien werden getrennt von allen durch eine betroffene Person angegebenen personenbezogenen Daten
    gespeichert.
</p>
<h4>Registrierung auf unserer Internetseite</h4>
<p>Die betroffene Person hat die M&ouml;glichkeit, sich auf der Internetseite des f&uuml;r die Verarbeitung Verantwortlichen unter
    Angabe von personenbezogenen Daten zu registrieren. Bei der Registrierung sind die Angabe einer E-Mail-Adresse und
    eines selbst gew&auml;hlten Benutzernamens Pflicht. Dabei wird der Benutzername f&uuml;r alle weiteren registrierten Nutzern
    ersichtlich sein, die E-Mail-Adresse nur f&uuml;r die Verantwortlichen der Internetseite. Optional ist die Angabe einer
    Schule oder Hochschule/Universit&auml;t m&ouml;glich, die allein zu statistischen Zwecken separat und ohne Zuordnung zu einem
    Benutzernamen oder E-Mail-Adresse gespeichert wird.
    <br>Durch eine Registrierung auf der Internetseite des f&uuml;r die Verarbeitung Verantwortlichen wird ferner die vom
    Internet-Service-Provider (ISP) der betroffenen Person vergebene IP-Adresse, das Datum sowie die Uhrzeit der
    Registrierung gespeichert. Die Speicherung dieser Daten erfolgt vor dem Hintergrund, dass nur so der Missbrauch
    unserer Dienste verhindert werden kann, und diese Daten im Bedarfsfall erm&ouml;glichen, begangene Straftaten
    aufzukl&auml;ren. Insofern ist die Speicherung dieser Daten zur Absicherung des f&uuml;r die Verarbeitung Verantwortlichen
    erforderlich. Eine Weitergabe dieser Daten an Dritte erfolgt grunds&auml;tzlich nicht, sofern keine gesetzliche Pflicht
    zur Weitergabe besteht oder die Weitergabe der Strafverfolgung dient.
    <br>Die Registrierung der betroffenen Person unter freiwilliger Angabe personenbezogener Daten dient dem f&uuml;r die
    Verarbeitung Verantwortlichen dazu, der betroffenen Person Inhalte oder Leistungen anzubieten, die aufgrund der
    Natur der Sache nur registrierten Benutzern angeboten werden k&ouml;nnen. Registrierten Personen steht die M&ouml;glichkeit
    frei, die bei der Registrierung angegebenen personenbezogenen Daten jederzeit abzu&auml;ndern oder vollst&auml;ndig aus dem
    Datenbestand des f&uuml;r die Verarbeitung Verantwortlichen l&ouml;schen zu lassen.
    <br>Der f&uuml;r die Verarbeitung Verantwortliche erteilt jeder betroffenen Person jederzeit auf Anfrage Auskunft
    dar&uuml;ber, welche personenbezogenen Daten &uuml;ber die betroffene Person gespeichert sind. Ferner berichtigt oder l&ouml;scht
    der f&uuml;r die Verarbeitung Verantwortliche personenbezogene Daten auf Wunsch oder Hinweis der betroffenen Person,
    soweit dem keine gesetzlichen Aufbewahrungspflichten entgegenstehen. Die Gesamtheit der Mitarbeiter des f&uuml;r die
    Verarbeitung Verantwortlichen stehen der betroffenen Person in diesem Zusammenhang als Ansprechpartner zur
    Verf&uuml;gung.
</p>
<h4>Routinem&auml;&szlig;ige L&ouml;schung und Sperrung von personenbezogenen Daten</h4>
<p>Der f&uuml;r die Verarbeitung Verantwortliche verarbeitet und speichert personenbezogene Daten der betroffenen Person
    nur f&uuml;r den Zeitraum, der zur Erreichung des Speicherungszwecks erforderlich ist oder sofern dies durch den
    Europ&auml;ischen Richtlinien- und Verordnungsgeber oder einen anderen Gesetzgeber in Gesetzen oder Vorschriften,
    welchen der f&uuml;r die Verarbeitung Verantwortliche unterliegt, vorgesehen wurde.
    <br>Entf&auml;llt der Speicherungszweck oder l&auml;uft eine vom Europ&auml;ischen Richtlinien- und Verordnungsgeber oder einem
    anderen zust&auml;ndigen Gesetzgeber vorgeschriebene Speicherfrist ab, werden die personenbezogenen Daten routinem&auml;&szlig;ig
    und entsprechend den gesetzlichen Vorschriften gesperrt oder gel&ouml;scht.
</p>
<h4>Rechte der betroffenen Person</h4>
<ul>
    <li><strong>Recht auf Best&auml;tigung:</strong>
        Jede betroffene Person hat das vom Europ&auml;ischen Richtlinien- und Verordnungsgeber einger&auml;umte Recht, von dem f&uuml;r
        die Verarbeitung Verantwortlichen eine Best&auml;tigung dar&uuml;ber zu verlangen, ob sie betreffende personenbezogene
        Daten verarbeitet werden. M&ouml;chte eine betroffene Person dieses Best&auml;tigungsrecht in Anspruch nehmen, kann sie
        sich hierzu jederzeit an ein Mitglied des Vorstandes des f&uuml;r die Verarbeitung Verantwortlichen wenden.
    </li>
    <li><strong>Recht auf Auskunft:</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, jederzeit von dem f&uuml;r die Verarbeitung Verantwortlichen unentgeltliche Auskunft
        &uuml;ber die zu seiner Person gespeicherten personenbezogenen Daten und eine Kopie dieser Auskunft zu erhalten.
        Ferner hat der Europ&auml;ische Richtlinien- und Verordnungsgeber der betroffenen Person Auskunft &uuml;ber folgende
        Informationen zugestanden:
        <br>
        <ul>
            <li>die Verarbeitungszwecke</li>
            <li>die Kategorien personenbezogener Daten, die verarbeitet werden</li>
            <li>die Empf&auml;nger oder Kategorien von Empf&auml;ngern, gegen&uuml;ber denen die personenbezogenen Daten offengelegt
                worden sind oder noch offengelegt werden, insbesondere bei Empf&auml;ngern in Drittl&auml;ndern oder bei
                internationalen Organisationen
            </li>
            <li>falls m&ouml;glich die geplante Dauer, f&uuml;r die die personenbezogenen Daten gespeichert werden, oder, falls
                dies nicht m&ouml;glich ist, die Kriterien f&uuml;r die Festlegung dieser Dauer
            </li>
            <li>das Bestehen eines Rechts auf Berichtigung oder L&ouml;schung der sie betreffenden personenbezogenen Daten
                oder auf Einschr&auml;nkung der Verarbeitung durch den Verantwortlichen oder eines Widerspruchsrechts
                gegen diese Verarbeitung
            </li>
            <li>das Bestehen eines Beschwerderechts bei einer Aufsichtsbeh&ouml;rde</li>
            <li>wenn die personenbezogenen Daten nicht bei der betroffenen Person erhoben werden: Alle verf&uuml;gbaren
                Informationen &uuml;ber die Herkunft der Daten
            </li>
            <li>das Bestehen einer automatisierten Entscheidungsfindung einschlie&szlig;lich Profiling gem&auml;&szlig;
                Artikel 22 Abs.1 und 4 DSGVO und — zumindest in diesen F&auml;llen — aussagekr&auml;ftige Informationen &uuml;ber die
                involvierte Logik sowie die Tragweite und die angestrebten Auswirkungen einer derartigen Verarbeitung
                f&uuml;r die betroffene Person
            </li>
            <li>Ferner steht der betroffenen Person ein Auskunftsrecht dar&uuml;ber zu, ob personenbezogene Daten an ein
                Drittland oder an eine internationale Organisation &uuml;bermittelt wurden. Sofern dies der Fall ist, so
                steht der betroffenen Person im &Uuml;brigen das Recht zu, Auskunft &uuml;ber die geeigneten Garantien im
                Zusammenhang mit der &Uuml;bermittlung zu erhalten.
            </li>
        </ul>
        M&ouml;chte eine betroffene Person dieses Auskunftsrecht in Anspruch nehmen, kann sie sich hierzu jederzeit
        an ein Mitglied des Vorstandes des f&uuml;r die Verarbeitung Verantwortlichen wenden.
    </li>
    <li><strong>Recht auf Berichtigung:</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, die unverz&uuml;gliche Berichtigung sie betreffender unrichtiger personenbezogener
        Daten zu verlangen. Ferner steht der betroffenen Person das Recht zu, unter Ber&uuml;cksichtigung der Zwecke der
        Verarbeitung, die Vervollst&auml;ndigung unvollst&auml;ndiger personenbezogener Daten — auch mittels einer erg&auml;nzenden
        Erkl&auml;rung — zu verlangen.
        <br>M&ouml;chte eine betroffene Person dieses Berichtigungsrecht in Anspruch nehmen, kann sie sich
        hierzu jederzeit an ein Mitglied des Vorstandes des f&uuml;r die Verarbeitung Verantwortlichen wenden.
    </li>
    <li><strong>Recht auf L&ouml;schung (Recht auf Vergessen werden):</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, von dem Verantwortlichen zu verlangen, dass die sie betreffenden
        personenbezogenen Daten unverz&uuml;glich gel&ouml;scht werden, sofern einer der folgenden Gr&uuml;nde zutrifft und soweit die
        Verarbeitung nicht erforderlich ist:
        <br>
        <ul>
            <li>Die personenbezogenen Daten wurden f&uuml;r solche Zwecke erhoben oder auf sonstige Weise verarbeitet, f&uuml;r
                welche sie nicht mehr notwendig sind.
            </li>
            <li> Die betroffene Person widerruft ihre Einwilligung, auf die sich die Verarbeitung gem&auml;&szlig;
                Art. 6 Abs. 1 Buchstabe a DSGVO oder Art. 9 Abs. 2 Buchstabe a DSGVO st&uuml;tzte, und es fehlt an einer
                anderweitigen Rechtsgrundlage f&uuml;r die Verarbeitung.
            </li>
            <li>Die betroffene Person legt gem&auml;&szlig; Art. 21 Abs. 1 DSGVO Widerspruch gegen die Verarbeitung
                ein, und es liegen keine vorrangigen berechtigten Gr&uuml;nde f&uuml;r die Verarbeitung vor, oder die
                betroffene Person legt gem&auml;&szlig; Art. 21 Abs. 2 DSGVO Widerspruch gegen die Verarbeitung ein.
            </li>
            <li>Die personenbezogenen Daten wurden unrechtm&auml;&szlig;ig verarbeitet.</li>
            <li>Die L&ouml;schung der personenbezogenen Daten ist zur Erf&uuml;llung einer rechtlichen Verpflichtung
                nach dem Unionsrecht oder dem Recht der Mitgliedstaaten erforderlich, dem der Verantwortliche
                unterliegt.
            </li>
            <li>Die personenbezogenen Daten wurden in Bezug auf angebotene Dienste der Informationsgesellschaft gem&auml;&szlig;
                Art. 8 Abs. 1 DSGVO erhoben.
            </li>
        </ul>
        Sofern einer der oben genannten Gr&uuml;nde zutrifft und eine betroffene Person die L&ouml;schung von personenbezogenen
        Daten, die bei der IEEE Student Branch Passau gespeichert sind, veranlassen m&ouml;chte, kann sie sich hierzu
        jederzeit an ein Mitglied des Vorstandes des f&uuml;r die Verarbeitung Verantwortlichen wenden. Das Mitglied des
        Vorstandes der IEEE Student Branch Passau wird veranlassen, dass dem L&ouml;schverlangen unverz&uuml;glich nachgekommen
        wird.
        <br>Wurden die personenbezogenen Daten von der IEEE Student Branch Passau &ouml;ffentlich gemacht
        und ist unsere Hochschulgruppe als Verantwortlicher gem&auml;&szlig; Art. 17 Abs. 1 DSGVO zur L&ouml;schung der
        personenbezogenen Daten verpflichtet, so trifft die IEEE Student Branch Passau unter Ber&uuml;cksichtigung der
        verf&uuml;gbaren Technologie und der Implementierungskosten angemessene Ma&szlig;nahmen, auch technischer Art,
        um andere f&uuml;r die Datenverarbeitung Verantwortliche, welche die ver&ouml;ffentlichten personenbezogenen
        Daten verarbeiten, dar&uuml;ber in Kenntnis zu setzen, dass die betroffene Person von diesen anderen f&uuml;r
        die Datenverarbeitung Verantwortlichen die L&ouml;schung s&auml;mtlicher Links zu diesen personenbezogenen Daten
        oder von Kopien oder Replikationen dieser personenbezogenen Daten verlangt hat, soweit die Verarbeitung nicht
        erforderlich ist. Das Mitglied des Vorstandes der IEEE Student Branch Passau wird im Einzelfall das Notwendige
        veranlassen.
    </li>
    <li><strong>Recht auf Einschr&auml;nkung der Verarbeitung:</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, von dem Verantwortlichen die Einschr&auml;nkung der Verarbeitung zu verlangen, wenn
        eine der folgenden Voraussetzungen gegeben ist:
        <br>
        <ul>
            <li>Die Richtigkeit der personenbezogenen Daten wird von der betroffenen Person bestritten, und zwar f&uuml;r
                eine Dauer, die es dem Verantwortlichen erm&ouml;glicht, die Richtigkeit der personenbezogenen Daten zu
                &uuml;berpr&uuml;fen.
            </li>
            <li>Die Verarbeitung ist unrechtm&auml;&szlig;ig, die betroffene Person lehnt die L&ouml;schung der
                personenbezogenen Daten ab und verlangt stattdessen die Einschr&auml;nkung der Nutzung der
                personenbezogenen Daten.
            </li>
            <li>Der Verantwortliche ben&ouml;tigt die personenbezogenen Daten f&uuml;r die Zwecke der Verarbeitung nicht
                l&auml;nger, die betroffene Person ben&ouml;tigt sie jedoch zur Geltendmachung, Aus&uuml;bung oder
                Verteidigung von Rechtsanspr&uuml;chen.
            </li>
            <li>Die betroffene Person hat Widerspruch gegen die Verarbeitung gem. Art. 21 Abs. 1 DSGVO eingelegt und es
                steht noch nicht fest, ob die berechtigten Gr&uuml;nde des Verantwortlichen gegen&uuml;ber denen der
                betroffenen Person &uuml;berwiegen.
            </li>
        </ul>
        Sofern eine der oben genannten Voraussetzungen gegeben ist und eine betroffene Person die Einschr&auml;nkung von
        personenbezogenen Daten, die bei der IEEE Student Branch Passau gespeichert sind, verlangen m&ouml;chte, kann
        sie sich hierzu jederzeit an ein Mitglied des Vorstandes des f&uuml;r die Verarbeitung Verantwortlichen wenden.
        Das Mitglied des Vorstandes der IEEE Student Branch Passau wird die Einschr&auml;nkung der Verarbeitung
        veranlassen.
    </li>
    <li><strong>Recht auf Daten&uuml;bertragbarkeit:</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, die sie betreffenden personenbezogenen Daten, welche durch die betroffene
        Person einem Verantwortlichen bereitgestellt wurden, in einem strukturierten, g&auml;ngigen und maschinenlesbaren
        Format zu erhalten. Sie hat au&szlig;erdem das Recht, diese Daten einem anderen Verantwortlichen ohne Behinderung
        durch den Verantwortlichen, dem die personenbezogenen Daten bereitgestellt wurden, zu &uuml;bermitteln, sofern die
        Verarbeitung auf der Einwilligung gem&auml;&szlig; Art. 6 Abs. 1 Buchstabe a DSGVO oder Art. 9 Abs. 2 Buchstabe a DSGVO
        oder auf einem Vertrag gem&auml;&szlig; Art. 6 Abs. 1 Buchstabe b DSGVO beruht und die Verarbeitung mithilfe
        automatisierter Verfahren erfolgt, sofern die Verarbeitung nicht f&uuml;r die Wahrnehmung einer Aufgabe erforderlich
        ist, die im &ouml;ffentlichen Interesse liegt oder in Aus&uuml;bung &ouml;ffentlicher Gewalt erfolgt, welche dem
        Verantwortlichen &uuml;bertragen wurde.
        <br>Ferner hat die betroffene Person bei der Aus&uuml;bung ihres Rechts auf Daten&uuml;bertragbarkeit gem&auml;&szlig;
        Art. 20 Abs. 1 DSGVO das Recht, zu erwirken, dass die personenbezogenen Daten direkt von einem Verantwortlichen
        an einen anderen Verantwortlichen &uuml;bermittelt werden, soweit dies technisch machbar ist und sofern hiervon nicht
        die Rechte und Freiheiten anderer Personen beeintr&auml;chtigt werden.
        <br>Zur Geltendmachung des Rechts auf Daten&uuml;bertragbarkeit kann sich die betroffene Person jederzeit an ein
        Mitglied des Vorstandes der IEEE Student Branch Passau wenden.
    </li>
    <li><strong>Recht auf Widerspruch:</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, aus Gr&uuml;nden, die sich aus ihrer besonderen Situation ergeben, jederzeit gegen
        die Verarbeitung sie betreffender personenbezogener Daten, die aufgrund von
        Art. 6 Abs. 1 Buchstaben e oder f DSGVO erfolgt, Widerspruch einzulegen. Dies gilt auch f&uuml;r ein auf diese
        Bestimmungen gest&uuml;tztes Profiling.
        <br>Die IEEE Student Branch Passau verarbeitet die
        personenbezogenen Daten im Falle des Widerspruchs nicht mehr, es sei denn, wir k&ouml;nnen zwingende schutzw&uuml;rdige
        Gr&uuml;nde f&uuml;r die Verarbeitung nachweisen, die den Interessen, Rechten und Freiheiten der betroffenen
        Person &uuml;berwiegen, oder die Verarbeitung dient der Geltendmachung, Aus&uuml;bung oder Verteidigung von
        Rechtsanspr&uuml;chen.
        <br>Verarbeitet die IEEE Student Branch Passau personenbezogene Daten, um Direktwerbung zu betreiben, so hat die
        betroffene Person das Recht, jederzeit Widerspruch gegen die Verarbeitung der personenbezogenen Daten zum Zwecke
        derartiger Werbung einzulegen. Dies gilt auch f&uuml;r das Profiling, soweit es mit solcher Direktwerbung in
        Verbindung steht. Widerspricht die betroffene Person gegen&uuml;ber der IEEE Student Branch Passau der Verarbeitung
        f&uuml;r Zwecke der Direktwerbung, so wird die IEEE Student Branch Passau die personenbezogenen Daten nicht mehr f&uuml;r
        diese Zwecke verarbeiten.
        <br>Zudem hat die betroffene Person das Recht, aus Gr&uuml;nden, die sich aus ihrer besonderen Situation ergeben,
        gegen die sie betreffende Verarbeitung personenbezogener Daten, die bei der IEEE Student Branch Passau zu
        wissenschaftlichen oder historischen Forschungszwecken oder zu statistischen Zwecken gem&auml;&szlig;
        Art. 89 Abs. 1 DSGVO erfolgen, Widerspruch einzulegen, es sei denn, eine solche Verarbeitung ist zur Erf&uuml;llung
        einer im &ouml;ffentlichen Interesse liegenden Aufgabe erforderlich.
        <br>Zur Aus&uuml;bung des Rechts auf Widerspruch kann sich die betroffene Person direkt an jedes Mitglied des
        Vorstandes der IEEE Student Branch Passau wenden. Der betroffenen Person steht es ferner frei, im Zusammenhang
        mit der Nutzung von Diensten der Informationsgesellschaft, ungeachtet der Richtlinie 2002/58/EG,
        ihr Widerspruchsrecht mittels automatisierter Verfahren auszu&uuml;ben, bei denen technische Spezifikationen
        verwendet werden.
    </li>
    <li><strong>Automatisierte Entscheidungen im Einzelfall einschlie&szlig;lich Profiling:</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, nicht einer ausschlie&szlig;lich auf einer automatisierten Verarbeitung —
        einschlie&szlig;lich Profiling — beruhenden Entscheidung unterworfen zu werden, die ihr gegen&uuml;ber rechtliche Wirkung
        entfaltet oder sie in &auml;hnlicher Weise erheblich beeintr&auml;chtigt, sofern die Entscheidung (1) nicht f&uuml;r den
        Abschluss oder die Erf&uuml;llung eines Vertrags zwischen der betroffenen Person und dem Verantwortlichen
        erforderlich ist, oder (2) aufgrund von Rechtsvorschriften der Union oder der Mitgliedstaaten, denen der
        Verantwortliche unterliegt, zul&auml;ssig ist und diese Rechtsvorschriften angemessene Ma&szlig;nahmen zur Wahrung der
        Rechte und Freiheiten sowie der berechtigten Interessen der betroffenen Person enthalten oder (3) mit
        ausdr&uuml;cklicher Einwilligung der betroffenen Person erfolgt.
        <br>Ist die Entscheidung (1) f&uuml;r den Abschluss oder die Erf&uuml;llung eines Vertrags zwischen der betroffenen Person
        und dem Verantwortlichen erforderlich oder (2) erfolgt sie mit ausdr&uuml;cklicher Einwilligung der betroffenen
        Person, trifft die IEEE Student Branch Passau angemessene Ma&szlig;nahmen, um die Rechte und Freiheiten sowie die
        berechtigten Interessen der betroffenen Person zu wahren, wozu mindestens das Recht auf Erwirkung des
        Eingreifens einer Person seitens des Verantwortlichen, auf Darlegung des eigenen Standpunkts und auf Anfechtung
        der Entscheidung geh&ouml;rt.
        <br>M&ouml;chte die betroffene Person Rechte mit Bezug auf automatisierte Entscheidungen geltend machen, kann sie
        sich hierzu jederzeit an ein Mitglied des Vorstandes des f&uuml;r die Verarbeitung Verantwortlichen wenden.
    </li>
    <li><strong>Recht auf Widerruf einer datenschutzrechtlichen Einwilligung:</strong>
        Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das vom Europ&auml;ischen Richtlinien- und
        Verordnungsgeber gew&auml;hrte Recht, eine Einwilligung zur Verarbeitung personenbezogener Daten jederzeit zu
        widerrufen. M&ouml;chte die betroffene Person ihr Recht auf Widerruf einer Einwilligung geltend machen, kann sie sich
        hierzu jederzeit an ein Mitglied des Vorstandes des f&uuml;r die Verarbeitung Verantwortlichen wenden.
    </li>
</ul>
<h4>Google reCAPTCHA</h4>
<p>In unserem Internetauftritt setzen wir Google reCAPTCHA zur &uuml;berpr&uuml;fung und Vermeidung von Interaktionen auf unserer
    Internetseite durch automatisierte Zugriffe, bspw. durch sog. Bots, ein. Es handelt sich hierbei um einen Dienst der
    Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA, nachfolgend nur „Google“ genannt.
    <br>Durch die Zertifizierung nach dem
    <a href="https://www.privacyshield.gov/participant?id=a2zt000000001L5AAI&amp;status=Active">EU-US-Datenschutzschild
        („EU-US Privacy Shield“)</a> garantiert Google, dass die Datenschutzvorgaben der EU auch bei der Verarbeitung
    von Daten in den USA eingehalten werden.
    <br>Durch diesen Dienst kann Google ermitteln, von welcher Webseite eine Anfrage gesendet wird sowie von welcher
    IP-Adresse aus Sie die sog. reCAPTCHA-Eingabebox verwenden. Neben Ihrer IP-Adresse werden wom&ouml;glich noch weitere
    Informationen durch Google erfasst, die f&uuml;r das Angebot und die Gew&auml;hrleistung dieses Dienstes notwendig sind.
    <br>Rechtsgrundlage ist Art. 6 Abs. 1 lit. f) DSGVO. Unser berechtigtes Interesse liegt in der Sicherheit unseres
    Internetauftritts sowie in der Abwehr unerw&uuml;nschter, automatisierter Zugriffe in Form von Spam o.&auml;..
    <br>Google bietet unter <a href="https://policies.google.com/privacy">https://policies.google.com/privacy</a>
    weitergehende Informationen zu dem allgemeinen Umgang mit Ihren Nutzerdaten an.
</p>
<h4>Gewinnspiel</h4>
<p>&uuml;ber unseren Internetauftritt bieten wir Ihnen die Teilnahme an Gewinnspielen an. Sofern Sie an einem unserer
    Gewinnspiele teilnehmen, werden die von Ihnen anl&auml;sslich der Teilnahme eingegebenen Daten ohne Ihre weitergehende
    Einwilligung, aber nat&uuml;rlich ausschlie&szlig;lich nur zur Durchf&uuml;hrung und Abwicklung des jeweiligen Gewinnspiels,
    verarbeitet.
    <br>Im Rahmen der Abwicklung des Gewinnspiels geben wir Ihre Daten an das mit der Warenlieferung beauftragte
    Transportunternehmen oder an einen Finanzdienstleister weiter, soweit die Weitergabe zur Lieferung bzw. Auszahlung
    Ihres Gewinns erforderlich ist. Sofern Ihre Daten im Falle eines Gewinns ver&ouml;ffentlicht werden, werden Sie hierauf
    im Rahmen der Einwilligungserkl&auml;rung hingewiesen.
    <br>Rechtsgrundlage f&uuml;r die Weitergabe der Daten ist dann Art. 6 Abs. 1 lit. b) DSGVO. Ihre Einwilligung in die
    Verarbeitung der Daten zur Teilnahme an unseren Gewinnspielen k&ouml;nnen Sie gem&auml;&szlig; Art. 7 Abs. 3 DSGVO jederzeit mit
    Wirkung f&uuml;r die Zukunft widerrufen. Hierzu m&uuml;ssen Sie uns lediglich &uuml;ber Ihren Widerruf in Kenntnis setzen.
</p>
<h4>Rechtsgrundlage der Verarbeitung</h4>
<p>Art. 6 I lit. a DSGVO dient unserer Hochschulgruppe als Rechtsgrundlage f&uuml;r Verarbeitungsvorg&auml;nge, bei denen wir eine
    Einwilligung f&uuml;r einen bestimmten Verarbeitungszweck einholen. Ist die Verarbeitung personenbezogener Daten zur
    Erf&uuml;llung eines Vertrags, dessen Vertragspartei die betroffene Person ist, erforderlich, wie dies beispielsweise bei
    Verarbeitungsvorg&auml;ngen der Fall ist, die f&uuml;r eine Lieferung von Waren oder die Erbringung einer sonstigen Leistung
    oder Gegenleistung notwendig sind, so beruht die Verarbeitung auf Art. 6 I lit. b DSGVO. Gleiches gilt f&uuml;r solche
    Verarbeitungsvorg&auml;nge die zur Durchf&uuml;hrung vorvertraglicher Ma&szlig;nahmen erforderlich sind, etwa in F&auml;llen von Anfragen
    zur unseren Produkten oder Leistungen. Unterliegt unserer Hochschulgruppe einer rechtlichen Verpflichtung durch
    welche eine Verarbeitung von personenbezogenen Daten erforderlich wird, wie beispielsweise zur Erf&uuml;llung
    steuerlicher Pflichten, so basiert die Verarbeitung auf Art. 6 I lit. c DSGVO. In seltenen F&auml;llen k&ouml;nnte die
    Verarbeitung von personenbezogenen Daten erforderlich werden, um lebenswichtige Interessen der betroffenen Person
    oder einer anderen nat&uuml;rlichen Person zu sch&uuml;tzen. Dies w&auml;re beispielsweise der Fall, wenn ein Besucher bei einer
    Veranstaltung der Hochschulgruppe verletzt werden w&uuml;rde und daraufhin sein Name, sein Alter, seine
    Krankenkassendaten oder sonstige lebenswichtige Informationen an einen Arzt, ein Krankenhaus oder sonstige Dritte
    weitergegeben werden m&uuml;ssten. Dann w&uuml;rde die Verarbeitung auf Art. 6 I lit. d DSGVO beruhen. Letztlich k&ouml;nnten
    Verarbeitungsvorg&auml;nge auf Art. 6 I lit. f DSGVO beruhen. Auf dieser Rechtsgrundlage basieren Verarbeitungsvorg&auml;nge,
    die von keiner der vorgenannten Rechtsgrundlagen erfasst werden, wenn die Verarbeitung zur Wahrung eines
    berechtigten Interesses unserer Hochschulgruppe oder eines Dritten erforderlich ist, sofern die Interessen,
    Grundrechte und Grundfreiheiten des Betroffenen nicht &uuml;berwiegen. Solche Verarbeitungsvorg&auml;nge sind uns insbesondere
    deshalb gestattet, weil sie durch den Europ&auml;ischen Gesetzgeber besonders erw&auml;hnt wurden. Er vertrat insoweit die
    Auffassung, dass ein berechtigtes Interesse anzunehmen sein k&ouml;nnte, wenn die betroffene Person ein Kunde des
    Verantwortlichen ist (Erw&auml;gungsgrund 47 Satz 2 DSGVO).
</p>
<ul>
    <li><strong>Berechtigte Interessen an der Verarbeitung, die von dem Verantwortlichen oder einem Dritten verfolgt
        werden:</strong>
        Basiert die Verarbeitung personenbezogener Daten auf Artikel 6 I lit. f DSGVO ist unser berechtigtes Interesse
        die Durchf&uuml;hrung unserer Gesch&auml;ftst&auml;tigkeit zugunsten des Wohlergehens all unserer Mitglieder.
    </li>
    <li><strong>Dauer, f&uuml;r die die personenbezogenen Daten gespeichert werden:</strong>
        Das Kriterium f&uuml;r die Dauer der Speicherung von personenbezogenen Daten ist die jeweilige gesetzliche
        Aufbewahrungsfrist. Nach Ablauf der Frist werden die entsprechenden Daten routinem&auml;&szlig;ig gel&ouml;scht, sofern sie
        nicht mehr zur Vertragserf&uuml;llung oder Vertragsanbahnung erforderlich sind.
    </li>
    <li><strong>Gesetzliche oder vertragliche Vorschriften zur Bereitstellung der personenbezogenen Daten;
        Erforderlichkeit f&uuml;r den Vertragsabschluss; Verpflichtung der betroffenen Person, die personenbezogenen
        Daten bereitzustellen; m&ouml;gliche Folgen der Nichtbereitstellung:</strong>
        Wir kl&auml;ren Sie dar&uuml;ber auf, dass die Bereitstellung personenbezogener Daten zum Teil gesetzlich vorgeschrieben
        ist (z.B. Steuervorschriften) oder sich auch aus vertraglichen Regelungen (z.B. Angaben zum Vertragspartner)
        ergeben kann. Mitunter kann es zu einem Vertragsschluss erforderlich sein, dass eine betroffene Person uns
        personenbezogene Daten zur Verf&uuml;gung stellt, die in der Folge durch uns verarbeitet werden m&uuml;ssen. Die
        betroffene Person ist beispielsweise verpflichtet uns personenbezogene Daten bereitzustellen, wenn unsere
        Hochschulgruppe mit ihr einen Vertrag abschlie&szlig;t. Eine Nichtbereitstellung der personenbezogenen Daten h&auml;tte zur
        Folge, dass der Vertrag mit dem Betroffenen nicht geschlossen werden k&ouml;nnte. Vor einer Bereitstellung
        personenbezogener Daten durch den Betroffenen muss sich der Betroffene an einen Mitglied unseres Vorstandes
        wenden. Das Vorstandsmitglied kl&auml;rt den Betroffenen einzelfallbezogen dar&uuml;ber auf, ob die Bereitstellung der
        personenbezogenen Daten gesetzlich oder vertraglich vorgeschrieben oder f&uuml;r den Vertragsabschluss erforderlich
        ist, ob eine Verpflichtung besteht, die personenbezogenen Daten bereitzustellen, und welche Folgen die
        Nichtbereitstellung der personenbezogenen Daten h&auml;tte.
    </li>
    <li><strong>Bestehen einer automatisierten Entscheidungsfindung:</strong>
        Als verantwortungsbewusste Hochschulgruppe verzichten wir auf eine automatische Entscheidungsfindung oder ein
        Profiling.
    </li>
</ul>
<p>Diese Datenschutzerkl&auml;rung wurde mithilfe des Datenschutzerkl&auml;rungs-Generator der DGD Deutsche Gesellschaft f&uuml;r
    Datenschutz GmbH, die als Datenschutzbeauftragter t&auml;tig ist, in Kooperation mit den Datenschutz Anw&auml;lten der Kanzlei
    WILDE BEUGER SOLMECKE | Rechtsanw&auml;lte sowie der
    <a href="https://www.ratgeberrecht.eu/leistungen/muster-datenschutzerklaerung.html">Muster-Datenschutzerkl&auml;rung</a>
    der <a href="https://www.ratgeberrecht.eu/">Anwaltskanzlei Wei&szlig; &amp; Partner</a> erstellt.
</p>
