<h3>Allgemein</h3>

<h4>D&uuml;rfen nur Studenten teilnehmen?</h4>
<p>Nein, es darf jeder teilnehmen, ganz gleich ob Student oder nicht.</p>

<h4>Wann werden die Aufgaben ver&ouml;ffentlicht?</h4>
<p>Jede Aufgabe wird um 9 Uhr morgens (Passauer Ortszeit) ver&ouml;ffentlicht. Die erste Aufgabe wird am 01.12.2016, die
    letzte am 24.12.2016 ver&ouml;ffentlicht.</p>

<h4>Muss ich eine Aufgabe innerhalb von 24 Stunden l&ouml;sen?</h4>
<p>Nein, alle Aufgaben k&ouml;nnen bis zum Ende des Jahres gel&ouml;st werden. Wann du eine Aufgabe l&ouml;st hat keinen
    Einfluss auf die Bewertung.</p>

<h4>Wie wird der Gewinner ermittelt, wenn es am Ende ein Gleichstand gibt?</h4>
<p>Sollte es nach Ende des Adventskalenders mehrere Teilnehmer mit gleicher Punktzahl geben, werden die ersten drei Pl&auml;tze
    durch eine Jury ermittelt.</p>

<h4>Nach welchen Kriterien bewertet die Jury meine Abgaben?</h4>
<p>Die Jury wird insbesondere auf folgende Kriterien achten:</p>
<ul>
    <li><strong>Code-Stil:</strong> Die Jury sollte deinen Code lesen und verstehen k&ouml;nnen. Aussagekr&auml;ftige
        Bezeichnungen und eine klare Strukturierung helfen viel!
    </li>
    <li><strong>Kommentare:</strong> Ein paar gut platzierte Kommentare helfen der Jury dein Programm zu verstehen.
        Seitenweise Boilerplate-Dokumentation hingegen will keiner lesen. Falls du einen besonders cleveren L&ouml;sungsweg
        oder Algorithmus entwickelt hast, darfst du diesen aber auch durchaus etwas genauer beschreiben.
    </li>
    <li><strong>Eleganz:</strong> Abgaben, welche eine Aufgabe besonders effizient oder mit besonders wenig Code l&ouml;sen,
        kommen bei der Jury gut an! Dein Code sollte nat&uuml;rlich trotzdem lesbar und verst&auml;ndlich sein.
    </li>
</ul>
<p>Falls n&ouml;tig, kann die Jury weitere Kriterien zur Bewertung heranziehen.</p>

<h4>Wie werden Punkte vergeben?</h4>
<p>Je nach Aufgabentyp k&ouml;nnen Punkte entweder statisch oder dynamisch vergeben werden. Weiterhin gibt es Aufgaben
    bei denen f&uuml;r die Bewertung neben dem Bestehen der Testf&auml;lle noch weitere Kriterien erf&uuml;llt sein m&uuml;ssen.</p>
<h5>Statische Punktvergabe</h5>
<p>Jede Aufgabe hat eine Reihe von Testf&auml;llen mit denen eingereichte L&ouml;sungen ausgewertet werden. Jeder
    Testfall ist eine gewisse Anzahl an Punkten wert. Eine Aufgabe mit vier Testf&auml;llen mit jeweils 25 Punkten ist
    also insgesamt 100 Punkte wert. Besteht eine Abgabe drei dieser Testf&auml;lle, so wird die Abgabe mit 75 Punkten
    bewertet. Die Gesamtpunktzahl eines Teilnehmers ergibt sich aus der Summe der besten Abgaben f&uuml;r jede
    Aufgabe.</p>
<h5>Dynamische Punktvergabe</h5>
<p>Jede Aufgabe hat eine Reihe von Testf&auml;llen mit denen eingereichte L&ouml;sungen ausgewertet werden. Insgesammt
    bringt eine Aufgabe bis zu 100 Punkte, je nachdem aus wie vielen Testf&auml;lle sie besteht. Je mehr Teilnehmer die
    Aufgabe richtig l&ouml;sen, desto weniger Punkte sind maximal erreichbar. <br/> So wird die Bewertung
    berechnet:<br/> <br/> Gesamte Abgaben (eine pro Teilnehmer) f&uuml;r das Problem: <strong>gesamt</strong><br/>
    Richtige L&ouml;sungen (eine pro Teilnehmer) f&uuml;r das Problem: <strong>gel&ouml;st</strong><br/> Der
    Abgeabefaktor (liegt zwischen 1 und 0) basierend auf den gel&ouml;sten Testf&auml;llen: <strong>sf</strong><br/>
    Mindestpunkte f&uuml;r ein richtig gel&ouml;stes Problem: 50<br/> Maximale Punkte f&uuml;r ein richtig gel&ouml;stes
    Problem: 100<br/> Anteil richtiger L&ouml;sungen: <strong>sr</strong> = gel&ouml;st / gesamt<br/> Problemfaktor:
    <strong>cf</strong> = 50 + (100 - 50) * (1 - sr)<br/> <br/> Damit ist die Bewertung: <strong>Punkte</strong> = sf *
    cf</p>
<p>&nbsp;</p>

<h4>Gibt es auch Punkte auf nur teilweise gel&ouml;ste Aufgaben?</h4>
<p>Ja, auch wenn deine Abgaben nicht alle Testf&auml;lle bestehen, bekommst du Punkte f&uuml;r eine Aufgabe. Daf&uuml;r
    wird jeweils die beste Abgabe herangezogen.</p>


<h3>Programmausf&uuml;hrung</h3>

<h4>Was ist der "Compiler Status"?</h4>
<p>Der Compiler Status ist eine Zahl, die vom Compiler an das System gegeben wird, wenn der Compiler mit seiner Arbeit
    fertig ist. Ein Wert von 0 signalisiert, dass es keine Probleme gab. Andere Werte deuten auf Fehler beim Kompilieren
    hin.</p>

<h4>Was ist der "Programm Status"?</h4>
<p>Der Programm Status ist eine Zahl, die vom deinem Programm an das System gegeben wird, wenn es mit seiner Arbeit
    fertig ist. Ein Wert von 0 signalisiert, dass das Programm ordnungsgem&auml;&szlig; beendet wurde. Andere Werte
    deuten auf einen Programmabsturz oder Fehler hin.</p>

<h4>Welche Einschr&auml;nkungen hat mein Programm?</h4>
<p>Dein Programm darf pro Testfall nicht mehr als 250 Megabyte Arbeitsspeicher belegen und nicht l&auml;nger als 60
    Sekunden rechnen. Aus Gr&uuml;nden der Fairness solltest du auf "kreative" Probleml&ouml;sungen verzichten, denn ein
    Fehler im Auswertungssystem hat einen negativen Einfluss auf alle Teilnehmenden.</p>

<h4>Wie lange darf mein Programm laufen?</h4>
<p>Dein Programm bekommt 60 Sekunden Laufzeit um einen Testfall zu bearbeiten.</p>

<h4>Wie viel Arbeitsspeicher darf mein Programm verwenden?</h4>
<p>Dein Programm darf maximal 250 Megabyte an Arbeitsspeicher verwenden um einen Testfall zu bearbeiten.</p>

<h4>Wie werden die Daten in mein Programm eingegeben?</h4>
<p>Wenn ein Testfall ausgef&uuml;hrt wird, erh&auml;lt dein Programm Daten &uuml;ber die Standardeingabe (STDIN), also
    so &auml;hnlich als ob man die Daten &uuml;ber die Tastatur eingibt. Nachdem alle Daten an dein Programm geschickt
    wurden, wird die Standardeingabe durch ein End Of File (EOF) geschlossen. Dein Programm muss diese Eingabe
    auswerten, ein Ergebnis berechnen, und dieses ausgeben.</p>

<h4>Wie muss ich mein Ergebnis ausgeben?</h4>
<p>Dein Programm muss die Eingabe auswerten, ein Ergebnis berechnen, und dieses ausgeben. Die Ausgabe muss auf der
    Standardausgabe (STDOUT) erfolgen. Als Zeilenumbruch k&ouml;nnen \n (Zeilenvorschub) oder \r\n (Wagenr&uuml;cklauf
    &amp; Zeilenvorschub) verwendet werden. Bitte beachte, dass oft auch nach dem letzten Ergebnis noch ein
    Zeilenumbruch erwartet wird!</p>

<h4>Wie kann ich in meiner Lieblingsprogrammiersprache Ein- und Ausgabe implementieren?</h4>
<p>Wir haben einige <a href="/examples">Beispielprogramme</a>
    erstellt, welche Ein- und Ausgabe in einigen h&auml;ufig genuzten Programmiersprachen anhand eines kleinen Beispiels
    demonstrieren.</p>

<h4>In welchen Programmiersprachen kann ich mein Programm einreichen?</h4>
<p>Du kannst dein Programm in den Sprachen C, Cobol, C++, C#, D, Forth, Fortran, FreePascal, Go, Haskell, Intercal,
    Java, Javascript, Lua, MMIX, OCaml, Objective-C, Perl, PHP, Python2, Python3, Rust, Scala, TCL, Vala oder
    VisualBasic .NET<br/> Deine Abgabe muss aus einer einzigen Datei bestehen. Sollten keine Besonderheiten angeben
    sein, so stehen dir nur die M&ouml;glichkeiten der Standardbibliothek der jeweiligen Sprache zu Verf&uuml;gung.</p>

<h4>K&ouml;nnt ihr Bibliothek X f&uuml;r die Programmiersprache Y installieren?</h4>
<p>Wir bieten f&uuml;r jede Programmiersprache grunds&auml;tzlich nur die Standardbibliotheken an, um zu gew&auml;hrleisten,
    dass jede Sprache in etwa gleich n&uuml;tzlich ist. Alle Sprachen durch das gezielte Installieren von Bibliotheken
    auf ein vergleichbares Niveau an Funktionalit&auml;t zu bringen w&auml;re ziemlich aufwendig: Wie bringen wir die F&auml;higkeiten
    von Numpy nach COBOL, Fortran und TCL? Daher belassen wir es bei den jeweiligen Standardbibliotheken. Au&szlig;erdem
    w&auml;re es ja langweilig eine L&ouml;sung zu entwickeln bei der die ganze Arbeit von ein paar Bibliotheken
    erledigt wird.</p>
<p>Du kannts in der <a href="/codelangs">Liste der unterstützten Programmiersprachen</a> nachschauen, welche Features
    unterstützt werden und welche Versionen installiert sind.</p>


<h3>Programmauswertung</h3>

<h4>Warum sind manche Testf&auml;lle als "geheim" gekennzeichnet?</h4>
<p>Dass nicht alle Testf&auml;lle komplett einsehbar sind hat mehrere Gr&uuml;nde: Einerseits wollen wir vermeiden, dass
    die Testf&auml;lle einfach von Hand gel&ouml;st werden und dann in die L&ouml;sung "hartcodiert" werden.
    Andererseits werden in geheimen Testf&auml;llen gewisse Rand- und Sonderf&auml;lle getestet, welche in den &ouml;ffentlichen
    Tests nicht auftauchen.</p>

<h4>Warum dauert es so lange meine Abgabe auszuwerten?</h4>
<p>Falls viele Teilnehmer den Kalender gleichzeitig benutzen, kann es durchaus vorkommen, dass die Auswertung etwas l&auml;nger
    dauert. Bitte hab in diesem Fall einfach etwas Geduld. Sollte deine Abgabe nach 15 Minuten immer noch nicht
    ausgewertet sein, kontaktiere uns bitte.</p>


<h3>Auswertungsstatus</h3>

<h4>Was bedeutet der Status "L&ouml;sung enth&auml;lt Fehler"?</h4>
<p>Deine L&ouml;sung hat einen oder mehrere Testf&auml;lle nicht bestanden. Schau dir die Liste der Testf&auml;lle noch
    einmal genau an, und &uuml;berarbeite deine L&ouml;sung.</p>

<h4>Was bedeutet der Status "L&ouml;sung wird noch ausgewertet..."?</h4>
<p>Deine eingereichte L&ouml;sung wird gerade noch vom System verarbeitet. Daher steht das endg&uuml;ltige Ergebnis noch
    nicht fest. Eventuell sind aber einige Testf&auml;lle schon fertig ausgewertet.</p>

<h4>Was bedeutet der Status "Falsche Ausgabe"?</h4>
<p>Die Ausgabe von deinem Programm entspricht nicht dem erwarteten Ergebnis. Bitte pr&uuml;fe vor dem Debuggen, ob du
    nicht eventuell einen Zeilenumbruch vergessen hast, denn dies ist erfahrungsgem&auml;&szlig; einer der h&auml;ufigsten
    Fehler.</p>

<h4>Was bedeutet der Status "Testfall in Bearbeitung"?</h4>
<p>Um eine Aufgabe vollst&auml;ndig zu l&ouml;sen, m&uuml;ssen alle Testf&auml;lle erfolgreich durchlaufen werden. Testf&auml;lle,
    die noch in Bearbeitung sind, wurden noch nicht ausgewertet. Sollte ein Testfall auch nach 15 Minuten immer noch
    nicht ausgewertet sein, kontaktiere uns bitte.</p>

<h4>Was bedeutet der Status "Laufzeitfehler im Programm"?</h4>
<p>Falls dein Programm abst&uuml;rzt oder eine Fehlermeldung ausgibt, gilt der Testfall als nicht bestanden. Du solltest
    anhand der Fehlermeldung herausfinden, was genau schiefgelaufen ist und dein Programm entsprechend anpassen.</p>

<h4>Was bedeutet der Status "Zugelassene Speichergrenze &uuml;berschritten"?</h4>
<p>In diesem Fall hat dein Programm die zugelassen H&ouml;chstspeichergrenze &uuml;berschritten. Sollte dies vorkommen
    wird dein Programm umgehend beendet, da es keinen weiteren Speicher mehr allozieren darf.</p>

<h4>Was bedeutet der Status "Zugelassene Laufzeit &uuml;berschritten"?</h4>
<p>Sollte ein Testfall diesen Status haben, so hat dein Programm die zugelassene H&ouml;chstlaufzeit &uuml;berschritten
    und wurde aus diesem Grund beendet. Sollte dieser Fehler auftreten, so kann er in der Regel durch die Wahl eines
    besseren bzw. effizienteren Algorithmus behoben werden.</p>

<h4>Was bedeutet der Status "Fehler beim Kompilieren"?</h4>
<p>Das Programm lie&szlig; sich nicht kompilieren, d.h. der verwendete Compiler verweigerte die Arbeit. Bitte pr&uuml;fe
    die Ausgabe des Compilers auf Fehler. Sollte der Quelltext bei dir mit der Standarddistribution der
    Programmiersprache kompilieren und du glaubst es sei ein Fehler, so kontaktiere uns bitte.</p>

<h4>Warum werden Scriptsprachen kompiliert?</h4>
<p>Jeder wei&szlig;, dass Scriptsprachen eigentlich nicht kompiliert werden, aber dennoch machen wir es - das
    Kompilieren umfasst in diesem Fall einfach das Parsen der Datei. Sollten hierbei Fehler auftreten, werden diese
    nicht als fehlerhaftes Programmergebnis gesehen, sondern als "Compiler"fehler.</p>


<h3>Ich habe ein Problem! / Meine Frage wurde nicht beantwortet!</h3>
<p>Solltest du eine Frage oder Anmerkung zu einer Aufgabe haben kannst du diese direkt &uuml;ber das Formular unterhalb
    der Aufgabe stellen. Bitte beachte aber, dass wir Fragen zu Aufgaben und deren Implementierung nicht immer
    beantworten k&ouml;nnnen.</p>
<p>Alternativ kannst du uns einfach eine E-Mail schreiben: <a
        href="mailto:adventskalender@ieee.students.uni-passau.de">adventskalender@ieee.students.uni-passau.de</a>. Wir
    freuen uns immer &uuml;ber Anmerkungen und Bugreports.</p>